# ComputeAreaOfCurveLoops Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..ComputeAreaOfCurveLoops Method
ExporterIFCUtils Class See Also
---
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static double ComputeAreaOfCurveLoops(
	IList<CurveLoop> curveLoops
)
```

Visual Basic
---
```text
Public Shared Function ComputeAreaOfCurveLoops ( _
	curveLoops As IList(Of CurveLoop) _
) As Double
```

Visual C++
---
```text
public:
static double ComputeAreaOfCurveLoops(
	IList<CurveLoop^>^ curveLoops
)
```

# ### Parameters
curveLoops
    Type: System.Collections.Generic..::..IList<(Of <(<'CurveLoop>)>)>
# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace